# Dataframes

Collection of series object

In [531]:
import pandas as pd
import numpy as np

## Creating Dataframe Objects

In [532]:
arr = np.random.randint(0,10,(5,3))

In [533]:
arr

array([[7, 6, 2],
       [9, 5, 9],
       [0, 8, 4],
       [8, 4, 2],
       [9, 9, 9]])

In [534]:
df = pd.DataFrame(arr)
df

   0  1  2
0  7  6  2
1  9  5  9
2  0  8  4
3  8  4  2
4  9  9  9

In [535]:
df.values

array([[7, 6, 2],
       [9, 5, 9],
       [0, 8, 4],
       [8, 4, 2],
       [9, 9, 9]])

In [536]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [537]:
df.columns

RangeIndex(start=0, stop=3, step=1)

In [538]:
df.values[0]

array([7, 6, 2])

In [539]:
df.index = ['R1', 'R2', 'R3', 'R4', 'R5']
df.columns = ['C1', 'C2', 'C3']
df

    C1  C2  C3
R1   7   6   2
R2   9   5   9
R3   0   8   4
R4   8   4   2
R5   9   9   9

In [540]:
df.loc['R3','C2']

8

In [541]:
df.iloc[2,1]

8

In [542]:
df.iloc[0] # returns a series object

C1    7
C2    6
C3    2
Name: R1, dtype: int32

In [543]:
df.iloc[:,0]

R1    7
R2    9
R3    0
R4    8
R5    9
Name: C1, dtype: int32

In [544]:
df.shape

(5, 3)

In [545]:
df.T

    R1  R2  R3  R4  R5
C1   7   9   0   8   9
C2   6   5   8   4   9
C3   2   9   4   2   9

In [546]:
def create_df(nrows,ncols,maxrand=10):
    arr = np.random.randint(0,10,(nrows,ncols))
    df = pd.DataFrame(arr)
    df.index = ['R'+str(x) for x in np.arange(1,nrows+1)]
    df.columns = ['C'+str(x) for x in range(1,ncols+1)]
    return df

In [547]:
create_df(5,3)

    C1  C2  C3
R1   7   0   6
R2   0   2   8
R3   9   1   1
R4   7   3   7
R5   8   7   9

In [548]:
diameter = pd.Series([4879,12104,12756,3475,6792,142984,120536,51118,49528], index = ['Mercury','Venus','Earth','Mars','Jupiter','Saturn','Uranus','Neptune','Pluto'])
mass = pd.Series([0.33,4.87,5.97,0.642,1898,568,86.2,102,0.0146], index = ['Mercury','Venus','Earth','Mars','Jupiter','Saturn','Uranus','Neptune','Pluto'])

In [549]:
diameter

Mercury      4879
Venus       12104
Earth       12756
Mars         3475
Jupiter      6792
Saturn     142984
Uranus     120536
Neptune     51118
Pluto       49528
dtype: int64

In [550]:
mass

Mercury       0.3300
Venus         4.8700
Earth         5.9700
Mars          0.6420
Jupiter    1898.0000
Saturn      568.0000
Uranus       86.2000
Neptune     102.0000
Pluto         0.0146
dtype: float64

In [551]:
df = pd.DataFrame({'mass':mass, 'diameter':diameter})
df

              mass  diameter
Mercury     0.3300      4879
Venus       4.8700     12104
Earth       5.9700     12756
Mars        0.6420      3475
Jupiter  1898.0000      6792
Saturn    568.0000    142984
Uranus     86.2000    120536
Neptune   102.0000     51118
Pluto       0.0146     49528

In [552]:
df['mass']['Earth']

5.97

In [553]:
df.mass.Earth

5.97

In [554]:
df['pop'] = 0

In [555]:
df

              mass  diameter  pop
Mercury     0.3300      4879    0
Venus       4.8700     12104    0
Earth       5.9700     12756    0
Mars        0.6420      3475    0
Jupiter  1898.0000      6792    0
Saturn    568.0000    142984    0
Uranus     86.2000    120536    0
Neptune   102.0000     51118    0
Pluto       0.0146     49528    0

In [556]:
df['pop']['Earth'] = 800000000
df

c:\users\hp\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

              mass  diameter        pop
Mercury     0.3300      4879          0
Venus       4.8700     12104          0
Earth       5.9700     12756  800000000
Mars        0.6420      3475          0
Jupiter  1898.0000      6792          0
Saturn    568.0000    142984          0
Uranus     86.2000    120536          0
Neptune   102.0000     51118          0
Pluto       0.0146     49528          0

In [557]:
df['mass'] is df.mass

True

In [558]:
df['pop'] is df.pop # as df.pop is a function in pandas dataframe which pop the values

False

In [559]:
df.loc['Earth']

mass        5.970000e+00
diameter    1.275600e+04
pop         8.000000e+08
Name: Earth, dtype: float64

In [560]:
df.loc[:,'mass']

df

              mass  diameter        pop
Mercury     0.3300      4879          0
Venus       4.8700     12104          0
Earth       5.9700     12756  800000000
Mars        0.6420      3475          0
Jupiter  1898.0000      6792          0
Saturn    568.0000    142984          0
Uranus     86.2000    120536          0
Neptune   102.0000     51118          0
Pluto       0.0146     49528          0

In [561]:
def create_mean_row(df):
    df.loc['Mean'] = np.mean(df,axis=0)
    return df
create_mean_row(df)

                mass  diameter           pop
Mercury     0.330000    4879.0  0.000000e+00
Venus       4.870000   12104.0  0.000000e+00
Earth       5.970000   12756.0  8.000000e+08
Mars        0.642000    3475.0  0.000000e+00
Jupiter  1898.000000    6792.0  0.000000e+00
Saturn    568.000000  142984.0  0.000000e+00
Uranus     86.200000  120536.0  0.000000e+00
Neptune   102.000000   51118.0  0.000000e+00
Pluto       0.014600   49528.0  0.000000e+00
Mean      296.225178   44908.0  8.888889e+07

In [562]:
df.drop('Mean')

              mass  diameter          pop
Mercury     0.3300    4879.0          0.0
Venus       4.8700   12104.0          0.0
Earth       5.9700   12756.0  800000000.0
Mars        0.6420    3475.0          0.0
Jupiter  1898.0000    6792.0          0.0
Saturn    568.0000  142984.0          0.0
Uranus     86.2000  120536.0          0.0
Neptune   102.0000   51118.0          0.0
Pluto       0.0146   49528.0          0.0

In [563]:
df.drop('pop',axis =1, inplace = True)# inplace = True is used to change it in orignal dataframe also

In [564]:
df.drop('Mean',inplace = True)

In [565]:
np.mean(df,axis=0)

mass          296.225178
diameter    44908.000000
dtype: float64

In [566]:
df

              mass  diameter
Mercury     0.3300    4879.0
Venus       4.8700   12104.0
Earth       5.9700   12756.0
Mars        0.6420    3475.0
Jupiter  1898.0000    6792.0
Saturn    568.0000  142984.0
Uranus     86.2000  120536.0
Neptune   102.0000   51118.0
Pluto       0.0146   49528.0

In [567]:
df.describe()

              mass       diameter
count     9.000000       9.000000
mean    296.225178   44908.000000
std     627.811488   52773.219968
min       0.014600    3475.000000
25%       0.642000    6792.000000
50%       5.970000   12756.000000
75%     102.000000   51118.000000
max    1898.000000  142984.000000

In [568]:
import seaborn as sns

In [569]:
df = sns.load_dataset('planets')

In [570]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
method            1035 non-null object
number            1035 non-null int64
orbital_period    992 non-null float64
mass              513 non-null float64
distance          808 non-null float64
year              1035 non-null int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

In [571]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [572]:
df.tail()

       method  number  orbital_period  mass  distance  year
1030  Transit       1        3.941507   NaN     172.0  2006
1031  Transit       1        2.615864   NaN     148.0  2007
1032  Transit       1        3.191524   NaN     174.0  2007
1033  Transit       1        4.125083   NaN     293.0  2008
1034  Transit       1        4.187757   NaN     260.0  2008

In [573]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [574]:
# Deleting rows with null value
for r in df.index:
    for c in df.columns:
        if pd.isnull(df.loc[r,c]):
            df.drop(r, inplace=True)
            break
df.describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [575]:
for i, r in df.iterrows():
    print(i)
    print(r)
    break

0
method            Radial Velocity
number                          1
orbital_period              269.3
mass                          7.1
distance                     77.4
year                         2006
Name: 0, dtype: object

In [576]:
for i,r in df.iterrows():
    if pd.isnull(r).any():
        df.drop(i, inplace = True)
df.describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [577]:
df.describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [578]:
df.dropna(inplace=True)

In [579]:
df.describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

Filter and show only those rows which have planets that are found in 2010s and method is 'Radial Velocity' and 'Transit' and distance is large(>75th percentile)

In [580]:
filtered = df[
    (df['year']>=2010) &
    ((df['method'] == 'Radial Velocity')|(df['method'] =='Transit')) &
    (df['distance']>np.percentile(df['distance'],75))
]

In [581]:
filtered.shape

(50, 6)

In [582]:
np.percentile(df['distance'],75)
#df.distance.quantile(0.75)

59.3325

In [583]:
filtered.head()

             method  number  orbital_period   mass  distance  year
9   Radial Velocity       2          452.80   1.99     74.79  2010
10  Radial Velocity       2          883.00   0.86     74.79  2010
58  Radial Velocity       1          277.02   1.70     80.64  2013
63  Radial Velocity       1          305.50  20.60     92.51  2013
84  Radial Velocity       1          137.48   1.11    175.44  2013

Modify the method column to have only the abbreviations of each method

In [584]:
df['method'].unique()

array(['Radial Velocity', 'Transit'], dtype=object)

In [585]:
s = 'Radial Velocity'
"".join([x[0] for x in s.split(" ")])

'RV'

In [586]:
short_names = {}
for s in df['method'].unique():
    short_names[s] = "".join([x[0] for x in s.split(" ")])
short_names

{'Radial Velocity': 'RV', 'Transit': 'T'}

In [587]:
for i, r in df.iterrows():
    df.loc[i, 'short_method'] = short_names.get(r['method'],r['method'])

In [588]:
df.head()

            method  number  orbital_period   mass  distance  year short_method
0  Radial Velocity       1         269.300   7.10     77.40  2006           RV
1  Radial Velocity       1         874.774   2.21     56.95  2008           RV
2  Radial Velocity       1         763.000   2.60     19.84  2011           RV
3  Radial Velocity       1         326.030  19.40    110.62  2007           RV
4  Radial Velocity       1         516.220  10.50    119.47  2009           RV

In [589]:
# Efficient Method

In [590]:
df1 = sns.load_dataset('planets')

In [591]:
def shorten_method(s):
    return short_names.get(s,s)
df1['short_method'] = df['method'].apply(shorten_method)

In [525]:
df1.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

Count the number of planets discovered for each method type

In [264]:
d={}
for m in df1.method.unique():
    d[m]= df[df['method']==m]['method'].count()
d

{'Radial Velocity': 553,
 'Imaging': 38,
 'Eclipse Timing Variations': 9,
 'Transit': 397,
 'Astrometry': 2,
 'Transit Timing Variations': 4,
 'Orbital Brightness Modulation': 3,
 'Microlensing': 23,
 'Pulsar Timing': 5,
 'Pulsation Timing Variations': 1}

In [268]:
df1.groupby('method').count()

,number,orbital_period,mass,distance,year,short_method
method,,,,,,
Astrometry,2,2,0,2,2,2
Eclipse Timing Variations,9,9,2,4,9,9
Imaging,38,12,0,32,38,38
Microlensing,23,7,0,10,23,23
Orbital Brightness Modulation,3,3,0,2,3,3
Pulsar Timing,5,5,0,1,5,5
Pulsation Timing Variations,1,1,0,0,1,1
Radial Velocity,553,553,510,530,553,553
Transit,397,397,1,224,397,397
Transit Timing Variations,4,3,0,3,4,4

In [269]:
df1.groupby('method')['method'].count()

method
Astrometry                         2
Eclipse Timing Variations          9
Imaging                           38
Microlensing                      23
Orbital Brightness Modulation      3
Pulsar Timing                      5
Pulsation Timing Variations        1
Radial Velocity                  553
Transit                          397
Transit Timing Variations          4
Name: method, dtype: int64

Find out what fraction of planets have been found in the last decade across each method

In [522]:
(df1[df1['year']>=2010].groupby('method')['method'].count())/df1.groupby('method')['method'].count()
#groupby() returns an iterable groups, each group object is made of tuple containing the
#Groups names and dataframes corresponding to groups

KeyError: 'year'

# Case Study

In [449]:
df1 = pd.read_csv('data.csv',index_col=0)
df2 = pd.read_csv('data (1).csv',index_col=0)

In [450]:
df1.head()
df2.head()

,Open,High,Low,Close,Shares Traded,Turnover (Rs. Cr)
Date,,,,,,
01-Jan-2019,10881.70,10923.60,10807.10,10910.10,159404542,8688.26
02-Jan-2019,10868.85,10895.35,10735.05,10792.50,309665939,15352.25
03-Jan-2019,10796.80,10814.05,10661.25,10672.25,286241745,15030.45
04-Jan-2019,10699.70,10741.05,10628.65,10727.35,296596655,14516.74
07-Jan-2019,10804.85,10835.95,10750.15,10771.80,269371080,12731.29

In [451]:
df1.drop(['Shares Traded','Turnover (Rs. Cr)'],axis=1,inplace=True)
df2.drop(['Shares Traded','Turnover (Rs. Cr)'],axis=1,inplace=True)

In [452]:
df1.head()

                 Open      High       Low     Close
Date
01-Jan-2018  10531.70  10537.85  10423.10  10435.55
02-Jan-2018  10477.55  10495.20  10404.65  10442.20
03-Jan-2018  10482.65  10503.60  10429.55  10443.20
04-Jan-2018  10469.40  10513.00  10441.45  10504.80
05-Jan-2018  10534.25  10566.10  10520.10  10558.85

In [307]:
df2.head()

                 Open      High       Low     Close
Date
01-Jan-2019  10881.70  10923.60  10807.10  10910.10
02-Jan-2019  10868.85  10895.35  10735.05  10792.50
03-Jan-2019  10796.80  10814.05  10661.25  10672.25
04-Jan-2019  10699.70  10741.05  10628.65  10727.35
07-Jan-2019  10804.85  10835.95  10750.15  10771.80

In [308]:
# combining both data
df3=pd.concat([df1,df2])

In [312]:
print(df1.shape,df2.shape)
df3.shape

(246, 4) (245, 4)

(491, 4)

In [355]:
df4 = pd.read_csv('data (2).csv',index_col=0)
df4.head()

,Open,High,Low,Close,Shares Traded,Turnover (Rs. Cr)
Date,,,,,,
01-Jan-2019,28243.95,28252.20,27988.60,28111.65,100916543,2354.60
02-Jan-2019,28074.05,28188.40,27801.75,27876.95,167334185,3410.28
03-Jan-2019,27874.05,28045.30,27630.20,27674.65,175238949,3362.20
04-Jan-2019,27707.20,27842.75,27533.90,27719.50,163387940,3295.06
07-Jan-2019,27893.95,27932.00,27652.95,27706.60,135700262,2862.02

In [356]:
df4.drop(['Shares Traded','Turnover (Rs. Cr)'],axis=1,inplace=True)
df4.head()

                 Open      High       Low     Close
Date
01-Jan-2019  28243.95  28252.20  27988.60  28111.65
02-Jan-2019  28074.05  28188.40  27801.75  27876.95
03-Jan-2019  27874.05  28045.30  27630.20  27674.65
04-Jan-2019  27707.20  27842.75  27533.90  27719.50
07-Jan-2019  27893.95  27932.00  27652.95  27706.60

In [357]:
df5 = pd.concat([df2,df4],axis = 1,keys=['nifty50','next nifty50'])
df5.shape

(245, 8)

In [358]:
df5.head() #hierarical indexing

              nifty50                               next nifty50            \
                 Open      High       Low     Close         Open      High
Date
01-Jan-2019  10881.70  10923.60  10807.10  10910.10     28243.95  28252.20
02-Jan-2019  10868.85  10895.35  10735.05  10792.50     28074.05  28188.40
03-Jan-2019  10796.80  10814.05  10661.25  10672.25     27874.05  28045.30
04-Jan-2019  10699.70  10741.05  10628.65  10727.35     27707.20  27842.75
07-Jan-2019  10804.85  10835.95  10750.15  10771.80     27893.95  27932.00


                  Low     Close
Date
01-Jan-2019  27988.60  28111.65
02-Jan-2019  27801.75  27876.95
03-Jan-2019  27630.20  27674.65
04-Jan-2019  27533.90  27719.50
07-Jan-2019  27652.95  27706.60

In [359]:
df5['nifty50']['Open'].head()

Date
01-Jan-2019    10881.70
02-Jan-2019    10868.85
03-Jan-2019    10796.80
04-Jan-2019    10699.70
07-Jan-2019    10804.85
Name: Open, dtype: float64

In [360]:
df5.loc['01-Jan-2019']

nifty50       Open     10881.70
              High     10923.60
              Low      10807.10
              Close    10910.10
next nifty50  Open     28243.95
              High     28252.20
              Low      27988.60
              Close    28111.65
Name: 01-Jan-2019, dtype: float64

In [384]:
df5['nifty50','volatile'] = df5['nifty50','High']>1.05*df5['nifty50','Low']
df5['next nifty50','volatile'] = df5['next nifty50','High']>1.05*df5['next nifty50','Low']
df5.head()

              nifty50                               next nifty50            \
                 Open      High       Low     Close         Open      High
Date
01-Jan-2019  10881.70  10923.60  10807.10  10910.10     28243.95  28252.20
02-Jan-2019  10868.85  10895.35  10735.05  10792.50     28074.05  28188.40
03-Jan-2019  10796.80  10814.05  10661.25  10672.25     27874.05  28045.30
04-Jan-2019  10699.70  10741.05  10628.65  10727.35     27707.20  27842.75
07-Jan-2019  10804.85  10835.95  10750.15  10771.80     27893.95  27932.00

                                 nifty50 next nifty50
                  Low     Close volatile     volatile
Date
01-Jan-2019  27988.60  28111.65    False        False
02-Jan-2019  27801.75  27876.95    False        False
03-Jan-2019  27630.20  27674.65    False        False
04-Jan-2019  27533.90  27719.50    False        False
07-Jan-2019  27652.95  27706.60    False        False

In [389]:
print("In 2019, in how many days was the Nifty50 volatile (high > 105% of low)")
df5[df5['nifty50','volatile']]['nifty50','volatile'].count()

In 2019, in how many days was the Nifty50 volatile (high > 105% of low)

1

In [391]:
print("In 2019, in how many days was the Next Nifty50 volatile (high > 105% of low)")
df5[df5['next nifty50','volatile']]['next nifty50','volatile'].count()

In 2019, in how many days was the Next Nifty50 volatile (high > 105% of low)

1

In [443]:
print("In 2019, how many days belonged to the four classes Nifty50 volatile/non-volaile")
print("Both Volatile")
print(df5[df5['next nifty50','volatile']&df5['nifty50','volatile']]['nifty50','Open'].count())
print("Both Not Volatile")
print(df5[~df5['next nifty50','volatile']&~df5['nifty50','volatile']]['nifty50','Open'].count())
print("Nifty50 Volatile and Next Nifty50 not volatile")
print(df5[~df5['next nifty50','volatile']&df5['nifty50','volatile']]['nifty50','Open'].count())
print("Next Nifty50 Volatile and Nifty50 not volatile")
print(df5[df5['next nifty50','volatile']&~df5['nifty50','volatile']]['nifty50','Open'].count())

In 2019, how many days belonged to the four classes Nifty50 volatile/non-volaile
Both Volatile
1
Both Not Volatile
244
Nifty50 Volatile and Next Nifty50 not volatile
0
Next Nifty50 Volatile and Nifty50 not volatile
0

In [454]:
print('Mean, Median, Std. Dev, variance of closing values for each week day in Nifty50 data')
df2['day_of_week']=[pd.Timestamp(i).dayofweek for i in df2.index]
df2.groupby('day_of_week')['Close'].describe()

Mean, Median, Std. Dev, variance of closing values for each week day in Nifty50 data

,count,mean,std,min,25%,50%,75%,max
day_of_week,,,,,,,,
0,46.0,11463.535870,463.019749,10640.95,11054.8875,11573.475,11879.775,12262.75
1,50.0,11444.318000,462.829541,10604.35,10958.0500,11544.150,11794.125,12214.55
2,47.0,11385.222340,449.850387,10651.80,10974.0500,11440.200,11789.175,12221.65
3,50.0,11430.373000,470.461726,10672.25,10980.7000,11576.900,11843.200,12259.70
4,51.0,11435.394118,443.779665,10724.40,11029.3250,11456.900,11817.225,12271.80
6,1.0,11627.150000,NaN,11627.15,11627.1500,11627.150,11627.150,11627.15

In [458]:
print('Mean, Median, Std. Dev, variance of closing values for each Month in Nifty50 data')
df2['Month']=[pd.Timestamp(i).month for i in df2.index]
df2.groupby('Month')['Close'].describe()

Mean, Median, Std. Dev, variance of closing values for each Month in Nifty50 data

,count,mean,std,min,25%,50%,75%,max
Month,,,,,,,,
1,23.0,10809.463043,92.241175,10651.80,10754.7000,10821.600,10888.5500,10961.85
2,20.0,10833.840000,119.606867,10604.35,10778.9000,10819.025,10898.3000,11069.40
3,19.0,11317.242105,223.401346,10863.50,11113.1250,11354.250,11472.7250,11623.90
4,19.0,11666.452632,65.824517,11575.95,11601.2500,11665.950,11719.6750,11787.15
5,22.0,11592.022727,279.155921,11148.20,11316.2125,11683.075,11840.1375,11945.90
6,19.0,11839.023684,115.116579,11672.15,11756.4750,11841.550,11910.1250,12088.55
7,23.0,11523.110870,260.085388,11085.40,11307.6750,11555.900,11675.0500,11946.75
8,20.0,10976.500000,97.097806,10741.35,10924.0625,11007.175,11046.5250,11109.65
9,19.0,11124.289474,310.891386,10704.80,10846.2750,11003.500,11457.3250,11600.20
10,20.0,11490.205000,217.418539,11126.40,11313.8250,11523.300,11609.8625,11877.45
11,20.0,11964.132500,84.216057,11840.45,11904.9750,11940.700,12018.4625,12151.15
12,21.0,12096.880952,134.226928,11856.80,11994.2000,12086.700,12221.6500,12271.80

In [507]:
print("On the days in which Nifty50 closed higher than the open, what was the mean of (close - open) for Next Nifty50")
d = df5[df5['nifty50','Close']>df5['nifty50','Open']]
np.mean(d['next nifty50','Close']-d['next nifty50', 'Open'])

On the days in which Nifty50 closed higher than the open, what was the mean of (close - open) for Next Nifty50

118.70188679245271

In [501]:
print("In 2019, how many days had the day's high lower than the previous day low in Nifty50")
df2
df2['day_high_lower'] = 0
for i in range(1,len(df2['day_high_lower'])):
    df2['day_high_lower'][i] = df2['High'][i]-df2['Low'][i-1]
df2[df2['day_high_lower']>0]['Open'].count()

In 2019, how many days had the day's high lower than the previous day low in Nifty50

c:\users\hp\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """

237

In [521]:
print("In 2019, on how many days did the day's close exceed the 30 day moving average in Nifty50 (exculding first month)")
df2[df2['Close']>df2.rolling(30)['Close'].mean()].count()

In 2019, on how many days did the day's close exceed the 30 day moving average in Nifty50 (exculding first month)

Open              140
High              140
Low               140
Close             140
day_of_week       140
Month             140
day_high_lower    140
dtype: int64